aoc2018.org
:setup:
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: post
#+todo: todo | edit finished
#+PROPERTY: header-args :exports code :results output
:end:
#+title:  Advent of Code 2018
#+author: Piotr Kaznowski
#+date:   2020-01-03

* edit Day 04: Repose Record  :some:val:key:
CLOSED: [2020-01-18 Sat 18:22]
:PROPERTIES:
:EXPORT_FILE_NAME: day04
:EXPORT_HUGO_WEIGHT: 104
:EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :summary "Parsing with regexes, loops with hash-maps. Fully TDDed!"
:END:
** Puzzle summary
https://adventofcode.com/2018/day/4

As input we get list of strings like ="[1518-03-10 23:57] Guard #73 begins shift"= or ="... falls asleep"= / ="... wakes up"=. The list should be sorted and parsed to get information about amount of minutes of each guard was asleep. Then we need to find the guard which was asleep the most and find the minute on which he was statistically asleep the most. Puzzle answer is guard's ID multiplied by the chosen minute.

For part 2 we need to find the guard which has the highest occurence of one minute during which he was asleep. Answer is counted in the same way as in part 1.

** Descriptions               :noexport:
*** Part 1
You've sneaked into another supply closet - this time, it's across from the prototype suit manufacturing lab. You need to sneak inside and fix the issues with the suit, but there's a guard stationed outside the lab, so this is as close as you can safely get.

As you search the closet for anything that might help, you discover that you're not the first person to want to sneak in. Covering the walls, someone has spent an hour starting every midnight for the past few months secretly observing this guard post! They've been writing down the ID of the one guard on duty that night - the Elves seem to have decided that one guard was enough for the overnight shift - as well as when they fall asleep or wake up while at their post (your puzzle input).

For example, consider the following records, which have already been organized into chronological order:

#+begin_src txt :tangle inputs/day04-ex
[1518-11-01 00:00] Guard #10 begins shift
[1518-11-01 00:05] falls asleep
[1518-11-01 00:25] wakes up
[1518-11-01 00:30] falls asleep
[1518-11-01 00:55] wakes up
[1518-11-01 23:58] Guard #99 begins shift
[1518-11-02 00:40] falls asleep
[1518-11-02 00:50] wakes up
[1518-11-03 00:05] Guard #10 begins shift
[1518-11-03 00:24] falls asleep
[1518-11-03 00:29] wakes up
[1518-11-04 00:02] Guard #99 begins shift
[1518-11-04 00:36] falls asleep
[1518-11-04 00:46] wakes up
[1518-11-05 00:03] Guard #99 begins shift
[1518-11-05 00:45] falls asleep
[1518-11-05 00:55] wakes up
#+end_src

Timestamps are written using year-month-day hour:minute format. The guard falling asleep or waking up is always the one whose shift most recently started. Because all asleep/awake times are during the midnight hour (00:00 - 00:59), only the minute portion (00 - 59) is relevant for those events.

Visually, these records show that the guards are asleep at these times:

#+begin_example
Date   ID   Minute
            000000000011111111112222222222333333333344444444445555555555
            012345678901234567890123456789012345678901234567890123456789
11-01  #10  .....####################.....#########################.....
11-02  #99  ........................................##########..........
11-03  #10  ........................#####...............................
11-04  #99  ....................................##########..............
11-05  #99  .............................................##########.....
#+end_example

The columns are Date, which shows the month-day portion of the relevant day; ID, which shows the guard on duty that day; and Minute, which shows the minutes during which the guard was asleep within the midnight hour. (The Minute column's header shows the minute's ten's digit in the first row and the one's digit in the second row.) Awake is shown as ., and asleep is shown as #.

Note that guards count as asleep on the minute they fall asleep, and they count as awake on the minute they wake up. For example, because Guard #10 wakes up at 00:25 on 1518-11-01, minute 25 is marked as awake.

If you can figure out the guard most likely to be asleep at a specific time, you might be able to trick that guard into working tonight so you can have the best chance of sneaking in. You have two strategies for choosing the best guard/minute combination.

Strategy 1: _Find the guard that has the most minutes asleep_. What minute does that guard spend asleep the most?

In the example above, Guard #10 spent the most minutes asleep, a total of 50 minutes (20+25+5), while Guard #99 only slept for a total of 30 minutes (10+10+10). Guard #10 was asleep most during minute 24 (on two days, whereas any other minute the guard was asleep was only seen on one day).

While this example listed the entries in chronological order, your entries are in the order you found them. You'll need to organize them before they can be analyzed.

_What is the ID of the guard you chose multiplied by the minute you chose_? (In the above example, the answer would be 10 * 24 = 240.)
*** Part 2
Strategy 2: Of all guards, which guard is most frequently asleep on the same minute?

In the example above, Guard #99 spent minute 45 asleep more than any other guard or minute - three times in total. (In all other cases, any guard spent any minute asleep at most twice.)

What is the ID of the guard you chose multiplied by the minute you chose? (In the above example, the answer would be 99 * 45 = 4455.)

** Solution
[[https://gitlab.com/pkaznowski/aoc18/blob/master/src/aoc18/puzzle04.clj][Check full solution in the repo]]
 
*** Namespace :noexport:
#+name: day04_ns
#+begin_src clojure :noweb-ref code04 :results silent :exports none
  (ns aoc18.puzzle04 [:require [aoc18.utils :refer [input->str]]])

#+end_src

#+name: test04_ns
#+begin_src clojure :noweb-ref test04 :results silent :exports none
  (ns aoc18.puzzle04-test
    (:require [aoc18.puzzle04 :refer :all]
              [aoc18.utils :refer [input->str]]
              [clojure.test :refer :all]))

#+end_src

*** Parsing the logs
Let's grab all needed data (namely minute and, optionally, Guard's ID) using one func which should work like this:
#+name: day04_parse_test
#+begin_src clojure :noweb-ref test04 :exports code
  (deftest parse-test
    (testing "parse data and return hash-map with minutes and id if present"
      (is (= '(57 73) (parse "[1518-03-10 23:57] Guard #73 begins shift")))
      (is (= '(22 nil) (parse "[1518-03-11 00:22] wakes up")))))

#+end_src

The func should parse input with simple regex, than take searched groups (this is why I use ~rest~ because first group is the whole matched phrase) and convert matched strings to integers:
 
#+name: day04_parse
#+begin_src clojure :noweb-ref code04 
  (defn parse [log]
    (->> log
         (re-find #":(\d+)] (?:Guard #(\d+)|.)")
         rest
         (map #(if % (Integer/parseInt %) nil))))

#+end_src

Next, we need to process all log entries to get full info about each guard.
To accomplish that I will reduce all inputs using a ~hash-map~ where keys would be guards' ids and vals would be all minutes gathered from logs. The func should behave like that:

*** Get all data into a managable structure
#+name: day04_check_in_test
#+begin_src clojure :noweb-ref test04
  (deftest check-in-test
    (testing "should return hash-map with ids and minutes"
      (is (= {10 [5 25 30 55 24 29], 99 [40 50 36 46 45 55]}
             (check-in (input->str "day04-ex"))))))

#+end_src

(Where input is taken from the puzzle exemple.)

#+name: day04_check_in
#+begin_src clojure :noweb-ref code04
  (defn check-in [logs]
    (first
     (reduce
      (fn [[guards last] log]
        (let [[m id] (parse log)]
          (if id
            [(update guards id (fn [old] (or old []))) id]
            [(update guards last (fn [old] (conj (or old []) m))) last])))
      [{} nil]
      logs)))

#+end_src
#+name: day04_test_tangle

*** Helper: vec of ints to vec of 2-el-lists
Because I process only one input at a time, I don't know hom many minute ranges there will be for each guard. To fix output we need a simple helper which will convert vector of minutes to vector of lists containing falling asleep and waking up minute:
 
#+begin_src clojure :noweb-ref test04 :exports code
  (deftest get-ranges-test
    (testing "should split vector of ints into a vector of lists - pairs"
      (is (= ['(1 2) '(3 4) '(5 6)] (get-ranges [1 2 3 4 5 6])))))

#+end_src

I will loop over vector of minutes taking one pair each time until the list is exhausted:

#+name: day04_ranges
#+begin_src clojure :noweb-ref code04
  (defn get-ranges [minutes]
    (loop [pair (take 2 minutes)
           rest (drop 2 minutes)
           vec []]
      (if (empty? pair)
        vec
        (recur (take 2 rest) (drop 2 rest) (conj vec pair)))))

#+end_src

*** Helper: count sleepy minutes
Once we've got data ready to process we need to count minutes in given ranges. I will store minutes in a ~hash-map~ where keys are minutes and vals are occurences of a given minute throughout all logs of a guard:

#+name: day04_count_sleepy_test
#+begin_src clojure :noweb-ref test04
  (deftest count-sleepy-test
    (testing "should return hash-map of minutes and their occurences"
      (is (= {1 1, 2 2, 3 2, 4 1, 5 1}
             (count-sleepy [1 4 4 6 2 4 ])))))

#+end_src 

First I process minutes' vec with ~get-ranges~ than I cast the vec of ranges to double reduce func which will convert vec of sleep ranges into a range of numbers which will be used to update ~hash-map~ of all counted minutes (if given minute is already in the map, increase the counter by one, otherwise update the value for this minute with value of 1.

#+name: day04_count_sleepy
#+begin_src clojure :noweb-ref code04 
  (defn count-sleepy [minutes]
    (->> minutes
         get-ranges
         (reduce
          (fn [counted sleep-range]
            (reduce
             (fn [counted minute]
               (update counted minute (fn [count] (if count (inc count) 1))))
             counted
             (apply range sleep-range)))
          {})))

#+end_src

*** Process each guard data
To solve part 1 we need info about sum of minutes slept by each guard and the minute in which the guard was sleeping the most. 

#+begin_src clojure :noweb-ref test04
  (deftest process-guard-data-test
    (testing "should return hash-map with keys :minute :occurence and :sleep-time"
      (is (= '({:minute 24, :occurence 2, :sleep-time 50}
               {:minute 45, :occurence 3, :sleep-time 30})
             (map process-guard-data
                  [[5 25 30 55 24 29]
                   [40 50 36 46 45 55]])))))

#+end_src

Having all minutes stored in a ~hash-map~ we need only to apply ~max~ and ~+~ on values of each guard's map to get the most sleepy minute and all minutes slept respectively. Then we need to find the minute which had the highest occurence count. 

#+name: day04_find_max_min
#+begin_src clojure :noweb-ref code04 
  (defn process-guard-data [minutes]
    (let [counted (count-sleepy minutes)
          minute_count (apply max (vals counted))
          sum (apply + (vals counted))]
      (some
       #(when (= (val %) minute_count)
          {:minute (key %) :occurence minute_count :sleep-time sum})
       counted)))

#+end_src

*** Convert logs into vec of maps
Now we can start to put all pieces together and get the results.
First we have to process all the logs to get a ~vec~ of ~maps~ with info about guard ~:id~ and processed sleep times. 

For puzzle example data we should get result like this:
#+name: day04_process_logs_test
#+begin_src clojure :noweb-ref test04
  (deftest process-logs-test
    (testing "should meet puzzle 4 example data"
      (is (= [{:id 10, :minute 24, :occurence 2, :sleep-time 50}
              {:id 99, :minute 45, :occurence 3, :sleep-time 30}]
             (process-logs (check-in (input->str "day04-ex")))))))

#+end_src

#+name: day04_process_logs
#+begin_src clojure :noweb-ref code04
  (defn process-logs [logs]
    (reduce
     (fn [guards [id minutes]]
       (conj guards (merge {:id id} (process-guard-data minutes))))
     [] logs)) 

#+end_src

*** Find guard satisfying certain criteria
To solve part 1 we need to find the guard with the longes sleep time, while to solve part 2 we need a guard which has highest frequency of one minute slept. Let's put it into one func which will find a guard using given criterium:
 
#+name: day04_find_guard_with_most
#+begin_src clojure :noweb-ref code04
  (defn find-guard-with-most [what? logs]
    (reduce (fn [prev guard]
              (if (> (guard what?) (prev what?))
                guard prev))
            {:id nil :minute nil :occurence 0 :sleep-time 0}
            logs))

#+end_src

*** Getting the results
We are asked to return id number of chosen guard multiplied by the most slept minute:

#+name: day04_result
#+begin_src clojure :noweb-ref code04
  (defn result [{:keys [id minute]}]
    (* id minute))

#+end_src


Let's put everything together (it appeared that there are virtuous guards who never sleep on duty, so we need to filter logs with ~#(seq (last %)))~ which will exclude empty data):

#+name: day04_solve
#+begin_src clojure :noweb-ref code04 :results none
  (defn solve [input]
    (let [logs (->> input
                    input->str
                    sort
                    check-in
                    (filter #(seq (last %)))
                    process-logs)]
      {:part1 (time (result (find-guard-with-most :sleep-time logs)))
       :part2 (time (result (find-guard-with-most :occurence logs)))}))

#+end_src

Let's check if our solution passes the example data. 
#+name: day04_example_test
#+begin_src clojure :noweb-ref test04 
  (deftest example-test
    (testing "should return 240 for the first part, and 4455 fot the second"
      (is (= {:part1 240 :part2 4455} (solve "day04-ex")))))

#+end_src 

#+begin_src clojure :noweb yes :tangle test/aoc18/puzzle04_test.clj :exports none :results silent
  <<test04>>
#+end_src

Run all tests:

#+name: day04_tests
#+begin_src clojure :results output :exports results
  (require '[clojure.test :refer [run-tests]] 'aoc18.puzzle04-test)
  (run-tests 'aoc18.puzzle04-test)
#+end_src

#+RESULTS: day04_tests
: 
: Testing aoc18.puzzle04-test
: "Elapsed time: 0.010137 msecs"
: "Elapsed time: 0.010751 msecs"
: 
: Ran 7 tests containing 8 assertions.
: 0 failures, 0 errors.

#+name: day04_tangle
#+begin_src clojure :noweb yes :tangle src/aoc18/puzzle04.clj :exports none :results silent
  <<code04>>
#+end_src

Get the answer:

#+name: day04_results
#+begin_src clojure :ns aoc18.puzzle04 :exports results :results code
  (solve "day04")
#+end_src

#+RESULTS: day04_results
#+begin_src clojure
"Elapsed time: 0.208676 msecs"
"Elapsed time: 0.011375 msecs"
{:part1 3212, :part2 4966}
#+end_src


** COMMENT Commentary
